app/controllers/orders_controller.rb

  def ordenes_de_compra
    Get de todas las nuevas ordenes, se aceptan o rechazan
    key = KEY_SFTP_DEV
    Net::SFTP.start('integradev.ing.puc.cl', 'grupo9', :password => key) do |sftp|
      path = '/pedidos'
      sftp.dir.foreach("/pedidos") do |entry|
        sku = ''
        quantity = 0
        id = ''
        state = 'created'
        exists = false
        passed = true
        if entry.name != '.' && entry.name != '..' && entry.name !='.cache'
          file = sftp.file.open("#{path}/#{entry.name}")
          doc = Nokogiri::XML(file) do |config|
            config.noblanks
          end
          main_node = doc.xpath("//order").first
          subnode = main_node.children
          subnode.each do |node|
            if node.name == 'id'
              id = node.text
              if Order.find_by(:name => id)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."name" = $1 LIMIT $2  [["name", "5b0bbc035c8da70004285235"], ["LIMIT", 1]]

          unless exists
            # Crear orden en BDD
            new_order = Order.new( :name => id, :state => state, :sku => sku, :quantity => quantity, :missing => quantity, :check => false)
            if new_order.save
---
INSERT INTO "orders" ("name", "state", "sku", "quantity", "created_at", "updated_at", "missing", "check") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"