app/controllers/orders_controller.rb


                    if passed == 1
                        new_order = Order.new( :order => id, :estado => estado, :sku => sku, :quantity => quantity)
                        new_order.save
---
INSERT INTO "orders" ("name", "state", "sku", "quantity", "created_at", "updated_at", "missing", "check") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"